РАБОТЫ = {
    # Входная дверь
    "демонтаж_входной_двери": {
        "название": "Демонтаж входной двери",
        "раздел": "Входная дверь",
        "единица": "шт",
        "формула": "ширинавходнойдвери * высотавходнойдвери"
    },
    "монтаж_входной_двери": {
        "название": "Монтаж входной двери",
        "раздел": "Входная дверь",
        "единица": "шт",
        "формула": "ширинавходнойдвери * высотавходнойдвери"
    },

    # Потолки
    "демонтаж_потолка": {
        "название": "Демонтаж потолка: маскировочная лента",
        "раздел": "Потолок",
        "единица": "п.м.",
        "формула": "периметр"
    },
    ...
}