class РаботыБаза:
    def __init__(self):
        # База работ
        self.работы_база = {
            "демонтаж_входной_двери": {
                "порядок": 1,
                "раздел": "Входная дверь",
                "работы": [
                    {"вид": "Демонтаж металлического входного блока с полотном", 
                     "формула": "ширинавходнойдвери*высотавходнойдвери", "ед": "шт."},
                    {"вид": "Монтаж металлического входного блока с полотном", 
                     "формула": "ширинавходнойдвери*высотавходнойдвери", "ед": "шт."},
                    {"вид": "Переделка дверных откосов", 
                     "формула": "откосдвери*(2*высотавходнойдвери+ширинавходнойдвери)", "ед": "м²"}
                ]
            },
            "демонтаж_потолка": {
                "порядок": 2,
                "раздел": "Потолок",
                "работы": [
                    {"вид": "Демонтаж  маскировочной ленты", "формула": "периметр", "ед": "п.м."},
                    {"вид": "Монтаж маскировочной ленты", "формула": "периметр", "ед": "п.м."},
                    {"вид": "Демонтаж натяжного потолка", "формула": "площадьпотолка", "ед": "м²"},
                    {"вид": "Монтаж натяжного потолка", "формула": "площадьпотолка", "ед": "м²"},
                    {"вид": "Демонтаж багета", "формула": "периметр", "ед": "п.м."},
                    {"вид": "Монтаж багета", "формула": "периметр", "ед": "п.м."}
                ]
            },
            "демонтаж_обоев": {
                "порядок": 3,
                "раздел": "Стены",
                "работы": [
                    {"вид": "Демонтаж плинтуса", "формула": "плинтус", "ед": "п.м."},
                    {"вид": "Монтаж плинтуса", "формула": "плинтус", "ед": "п.м."},
                    {"вид": "Снятие обоев", "формула": "площадьстен", "ед": "м²"},
                    {"вид": "Поклейка обоев", "формула": "площадьстен", "ед": "м²"}
                ]
            },
            "демонтаж_пола": {
                "порядок": 4,
                "раздел": "Пол",
                "работы": [
                    {"вид": "Демонтаж ламината", "формула": "площадьпола", "ед": "м²"},
                    {"вид": "Монтаж ламината на подложку", "формула": "площадьпола", "ед": "м²"}
                ]
            },
            "демонтаж_окна": {
                "порядок": 5,
                "раздел": "Окна",
                "работы": [
                    {"вид": "демонтаж_окно_тип",  # Будет заменено в зависимости от типа окна
                     "формула": "ширинаокна*высотаокна", "ед": "м²"},
                    {"вид": "монтаж_окно_тип",  # Будет заменено в зависимости от типа окна
                     "формула": "ширинаокна*высотаокна", "ед": "м²"},
                    {"вид": "Переделка оконных откосов", 
                     "формула": "откосокна*(2*высотаокна+ширинаокна)", "ед": "м²"},
                    {"вид": "Демонтаж подоконника", "формула": "ширинаокна", "ед": "п.м."},
                    {"вид": "Монтаж подоконника", "формула": "ширинаокна", "ед": "п.м."}
                ]
            },
            "демонтаж_окна_с_сохранением": {
                "порядок": 5,
                "раздел": "Окна",
                "работы": [
                    {"вид": "демонтаж_окно_тип_с_сохранением", 
                     "формула": "ширинаокна*высотаокна", "ед": "м²"},
                    {"вид": "монтаж_окно_тип_с_сохранением", 
                     "формула": "ширинаокна*высотаокна", "ед": "м²"},
                    {"вид": "Переделка оконных откосов", 
                     "формула": "откосокна*(2*высотаокна+ширинаокна)", "ед": "м²"},
                    {"вид": "Демонтаж подоконника", "формула": "ширинаокна", "ед": "п.м."},
                    {"вид": "Монтаж подоконника", "формула": "ширинаокна", "ед": "п.м."}
                ]
            },
            "демонтаж_межкомнатной_двери": {
                "порядок": 6,
                "раздел": "Межкомнатная дверь",
                "работы": [
                    {"вид": "Демонтаж дверной коробки", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж дверной коробки", "формула": "1", "ед": "шт."},
                    {"вид": "Демонтаж наличников", "формула": "периметрмежкомнатнойдвери", "ед": "п.м."},
                    {"вид": "Монтаж наличников", "формула": "периметрмежкомнатнойдвери", "ед": "п.м."}
                ]
            },
            "демонтаж_настенной_плитки": {
                "порядок": 7,
                "раздел": "Стены",
                "работы": [
                    {"вид": "Демонтаж настенной керамической плитки", 
                     "формула": "площадьстенсанузел", "ед": "м²"},
                    {"вид": "Монтаж настенной керамической плитки", 
                     "формула": "площадьстенсанузел", "ед": "м²"}
                ]
            },
            "демонтаж_напольной_плитки": {
                "порядок": 4,
                "раздел": "Пол",
                "работы": [
                    {"вид": "Демонтаж напольной плитки ({размер})", 
                     "формула": "площадьполасанузел", "ед": "м²", "размер": True},
                    {"вид": "Монтаж напольной плитки ({размер})", 
                     "формула": "площадьполасанузел", "ед": "м²", "размер": True}
                ]
            },
            "демонтаж_напольной_плитки_керамогранит": {
                "порядок": 4,
                "раздел": "Пол",
                "работы": [
                    {"вид": "Демонтаж напольной плитки из керамогранита ({размер})", 
                     "формула": "площадьполасанузел", "ед": "м²", "размер": True},
                    {"вид": "Монтаж напольной плитки из керамогранита ({размер})", 
                     "формула": "площадьполасанузел", "ед": "м²", "размер": True}
                ]
            },
            "демонтаж_металлического_порога": {
                "порядок": 8,
                "раздел": "Пол",
                "работы": [
                    {"вид": "Демонтаж металлического порога", 
                     "формула": "ширина_дверного_проема", "ед": "п.м."},
                    {"вид": "Монтаж металлического порога", 
                     "формула": "ширина_дверного_проема", "ед": "п.м."}
                ]
            },
            "демонтаж_пвх_порога": {
                "порядок": 8,
                "раздел": "Пол",
                "работы": [
                    {"вид": "Демонтаж ПВХ порога", 
                     "формула": "ширина_дверного_проема", "ед": "п.м."},
                    {"вид": "Монтаж ПВХ порога", 
                     "формула": "ширина_дверного_проема", "ед": "п.м."}
                ]
            },
            "демонтаж_унитаза": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж унитаза (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж унитаза (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            },
            "демонтаж_подвесного_унитаза": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж подвесного унитаза (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж подвесного унитаза (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            },
            "демонтаж_ванны": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж ванны (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж ванны (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            },
            "демонтаж_раковины": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж раковины (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж раковины (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            },
            "демонтаж_смесителя": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж смесителя (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж смесителя (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            },
            "демонтаж_полотенцесушителя": {
                "порядок": 9,
                "раздел": "Сантехническое оборудование",
                "работы": [
                    {"вид": "Демонтаж полотенцесушителя (с сохранением)", "формула": "1", "ед": "шт."},
                    {"вид": "Монтаж полотенцесушителя (с сохранением)", "формула": "1", "ед": "шт."}
                ]
            }
        }
